yvkonkov91/Microcontrolers-arm/stm8/Project/lib/lib3/inc/iostm8l101k3.h
/* USART Control Register 2 */
#ifdef __IAR_SYSTEMS_ICC__
typedef struct
{
  unsigned char SBK         : 1;
  unsigned char RWU         : 1;
  unsigned char REN         : 1;
  unsigned char TEN         : 1;
  unsigned char ILIEN       : 1;
  unsigned char RIEN        : 1;
  unsigned char TCIEN       : 1;
  unsigned char TIEN        : 1;
} __BITS_USART_CR2;
#endif
__IO_REG8_BIT(USART_CR2,   0x5235, __READ_WRITE, __BITS_USART_CR2);

/* USART Control Register 3 */
#ifdef __IAR_SYSTEMS_ICC__
typedef struct
{
  unsigned char LBCL        : 1;
  unsigned char CPHA        : 1;
  unsigned char CPOL        : 1;
  unsigned char CLKEN       : 1;
  unsigned char STOP        : 2;
} __BITS_USART_CR3;
#endif
__IO_REG8_BIT(USART_CR3,   0x5236, __READ_WRITE, __BITS_USART_CR3);

/* USART Control Register 4 */
#ifdef __IAR_SYSTEMS_ICC__
typedef struct
{
  unsigned char ADD         : 4;
} __BITS_USART_CR4;
#endif
__IO_REG8_BIT(USART_CR4,   0x5237, __READ_WRITE, __BITS_USART_CR4);


/*-------------------------------------------------------------------------
 *      USART bit fields
 *-----------------------------------------------------------------------*/
#ifdef __IAR_SYSTEMS_ICC__

#define USART_SR_PE              USART_SR_bit.PE
#define USART_SR_FE              USART_SR_bit.FE
#define USART_SR_NF              USART_SR_bit.NF
#define USART_SR_OR              USART_SR_bit.OR
#define USART_SR_IDLE            USART_SR_bit.IDLE
#define USART_SR_RXNE            USART_SR_bit.RXNE
#define USART_SR_TC              USART_SR_bit.TC
#define USART_SR_TXE             USART_SR_bit.TXE

#define USART_CR1_PIEN           USART_CR1_bit.PIEN
#define USART_CR1_PS             USART_CR1_bit.PS
#define USART_CR1_PCEN           USART_CR1_bit.PCEN
#define USART_CR1_WAKE           USART_CR1_bit.WAKE
#define USART_CR1_MSL            USART_CR1_bit.MSL
#define USART_CR1_USARTD         USART_CR1_bit.USARTD
#define USART_CR1_T8             USART_CR1_bit.T8
#define USART_CR1_R8             USART_CR1_bit.R8

#define USART_CR2_SBK            USART_CR2_bit.SBK
#define USART_CR2_RWU            USART_CR2_bit.RWU
#define USART_CR2_REN            USART_CR2_bit.REN
#define USART_CR2_TEN            USART_CR2_bit.TEN
#define USART_CR2_ILIEN          USART_CR2_bit.ILIEN
#define USART_CR2_RIEN           USART_CR2_bit.RIEN
#define USART_CR2_TCIEN          USART_CR2_bit.TCIEN
#define USART_CR2_TIEN           USART_CR2_bit.TIEN

#define USART_CR3_LBCL           USART_CR3_bit.LBCL
#define USART_CR3_CPHA           USART_CR3_bit.CPHA
#define USART_CR3_CPOL           USART_CR3_bit.CPOL
#define USART_CR3_CLKEN          USART_CR3_bit.CLKEN
#define USART_CR3_STOP           USART_CR3_bit.STOP

#define USART_CR4_ADD            USART_CR4_bit.ADD

#endif

/*-------------------------------------------------------------------------
 *      USART bit masks
 *-----------------------------------------------------------------------*/
#define MASK_USART_SR_PE         0x01
#define MASK_USART_SR_FE         0x02
#define MASK_USART_SR_NF         0x04
#define MASK_USART_SR_OR         0x08
#define MASK_USART_SR_IDLE       0x10
#define MASK_USART_SR_RXNE       0x20
#define MASK_USART_SR_TC         0x40
#define MASK_USART_SR_TXE        0x80

#define MASK_USART_CR1_PIEN      0x01
#define MASK_USART_CR1_PS        0x02
#define MASK_USART_CR1_PCEN      0x04
#define MASK_USART_CR1_WAKE      0x08
#define MASK_USART_CR1_MSL       0x10
#define MASK_USART_CR1_USARTD    0x20
#define MASK_USART_CR1_T8        0x40
#define MASK_USART_CR1_R8        0x80

#define MASK_USART_CR2_SBK       0x01
#define MASK_USART_CR2_RWU       0x02
#define MASK_USART_CR2_REN       0x04
#define MASK_USART_CR2_TEN       0x08
#define MASK_USART_CR2_ILIEN     0x10
#define MASK_USART_CR2_RIEN      0x20
#define MASK_USART_CR2_TCIEN     0x40
#define MASK_USART_CR2_TIEN      0x80

#define MASK_USART_CR3_LBCL      0x01
#define MASK_USART_CR3_CPHA      0x02
#define MASK_USART_CR3_CPOL      0x04
#define MASK_USART_CR3_CLKEN     0x08
#define MASK_USART_CR3_STOP      0x30

#define MASK_USART_CR4_ADD       0x0F


/*-------------------------------------------------------------------------
 *      TIM2 register definitions
 *-----------------------------------------------------------------------*/
/* TIM2 Control register 1 */
#ifdef __IAR_SYSTEMS_ICC__
typedef struct
{
  unsigned char CEN         : 1;
  unsigned char UDIS        : 1;
  unsigned char URS         : 1;
  unsigned char OPM         : 1;
  unsigned char DIR         : 1;
  unsigned char CMS         : 2;
  unsigned char ARPE        : 1;
} __BITS_TIM2_CR1;
#endif
__IO_REG8_BIT(TIM2_CR1,    0x5250, __READ_WRITE, __BITS_TIM2_CR1);

/* TIM2 Control register 2 */
#ifdef __IAR_SYSTEMS_ICC__
typedef struct
{
  unsigned char             : 4;
  unsigned char MMS         : 3;
} __BITS_TIM2_CR2;
#endif
__IO_REG8_BIT(TIM2_CR2,    0x5251, __READ_WRITE, __BITS_TIM2_CR2);

/* TIM2 Slave Mode Control register */
#ifdef __IAR_SYSTEMS_ICC__
typedef struct
{
  unsigned char SMS         : 3;
  unsigned char             : 1;
  unsigned char TS          : 3;
  unsigned char MSM         : 1;
} __BITS_TIM2_SMCR;
#endif
__IO_REG8_BIT(TIM2_SMCR,   0x5252, __READ_WRITE, __BITS_TIM2_SMCR);

/* TIM2 external trigger register */
#ifdef __IAR_SYSTEMS_ICC__
typedef struct
{
  unsigned char ETF         : 4;
  unsigned char ETPS        : 2;
  unsigned char ECE         : 1;
  unsigned char ETP         : 1;
} __BITS_TIM2_ETR;
#endif
__IO_REG8_BIT(TIM2_ETR,    0x5253, __READ_WRITE, __BITS_TIM2_ETR);

/* TIM2 Interrupt enable register */
#ifdef __IAR_SYSTEMS_ICC__
typedef struct
{
  unsigned char UIE         : 1;
  unsigned char CC1IE       : 1;
  unsigned char CC2IE       : 1;
  unsigned char             : 3;
  unsigned char TIE         : 1;
  unsigned char BIE         : 1;
} __BITS_TIM2_IER;
#endif
__IO_REG8_BIT(TIM2_IER,    0x5254, __READ_WRITE, __BITS_TIM2_IER);

/* TIM2 Status register 1 */
#ifdef __IAR_SYSTEMS_ICC__
typedef struct
{
  unsigned char UIF         : 1;
  unsigned char CC1IF       : 1;
  unsigned char CC2IF       : 1;
  unsigned char             : 3;
  unsigned char TIF         : 1;
  unsigned char BIF         : 1;
} __BITS_TIM2_SR1;
#endif
__IO_REG8_BIT(TIM2_SR1,    0x5255, __READ_WRITE, __BITS_TIM2_SR1);

/* TIM2 Status register 2 */
#ifdef __IAR_SYSTEMS_ICC__
typedef struct
{
  unsigned char             : 1;
  unsigned char CC1OF       : 1;
  unsigned char CC2OF       : 1;
} __BITS_TIM2_SR2;
#endif
__IO_REG8_BIT(TIM2_SR2,    0x5256, __READ_WRITE, __BITS_TIM2_SR2);

/* TIM2 Event Generation register */
#ifdef __IAR_SYSTEMS_ICC__
typedef struct
{
  unsigned char UG          : 1;
  unsigned char CC1G        : 1;
  unsigned char CC2G        : 1;
  unsigned char             : 3;
  unsigned char TG          : 1;
  unsigned char BG          : 1;
} __BITS_TIM2_EGR;
#endif
__IO_REG8_BIT(TIM2_EGR,    0x5257, __WRITE, __BITS_TIM2_EGR);

/* TIM2 Capture/Compare mode register 1 */
#ifdef __IAR_SYSTEMS_ICC__
typedef struct
{
  unsigned char CC1S        : 2;
  unsigned char IC1PSC      : 2;
  unsigned char IC1F        : 4;
} __BITS_TIM2_CCMR1_CAPTURE;
#endif
__IO_REG8_BIT(TIM2_CCMR1_CAPTURE, 0x5258, __READ_WRITE, __BITS_TIM2_CCMR1_CAPTURE);

/* TIM2 Capture/Compare mode register 1 */
#ifdef __IAR_SYSTEMS_ICC__
typedef struct
{
  unsigned char CC1S        : 2;
  unsigned char OC1FE       : 1;
  unsigned char OC1PE       : 1;
  unsigned char OC1M        : 3;
} __BITS_TIM2_CCMR1_COMPARE;
#endif
__IO_REG8_BIT(TIM2_CCMR1_COMPARE, 0x5258, __READ_WRITE, __BITS_TIM2_CCMR1_COMPARE);

/* TIM2 Capture/Compare mode register 2 */
#ifdef __IAR_SYSTEMS_ICC__
typedef struct
{
  unsigned char CC2S        : 2;
  unsigned char IC2PSC      : 2;
  unsigned char IC2F        : 4;
} __BITS_TIM2_CCMR2_CAPTURE;
#endif
__IO_REG8_BIT(TIM2_CCMR2_CAPTURE, 0x5259, __READ_WRITE, __BITS_TIM2_CCMR2_CAPTURE);

/* TIM2 Capture/Compare mode register 2 */
#ifdef __IAR_SYSTEMS_ICC__
typedef struct
{
  unsigned char CC2S        : 2;
  unsigned char OC2FE       : 1;
  unsigned char OC2PE       : 1;
  unsigned char OC2M        : 3;
} __BITS_TIM2_CCMR2_COMPARE;
#endif
__IO_REG8_BIT(TIM2_CCMR2_COMPARE, 0x5259, __READ_WRITE, __BITS_TIM2_CCMR2_COMPARE);

