yvkonkov91/Microcontrolers-arm/stm8/Project/lib/lib3/inc/iostm8l101k3.h
/* TIM4 Counter */
__IO_REG8    (TIM4_CNTR,   0x52E6, __READ_WRITE);
/* TIM4 Prescaler register */
#ifdef __IAR_SYSTEMS_ICC__
typedef struct
{
  unsigned char PSC         : 4;
} __BITS_TIM4_PSCR;
#endif
__IO_REG8_BIT(TIM4_PSCR,   0x52E7, __READ_WRITE, __BITS_TIM4_PSCR);

/* TIM4 Auto-reload register low */
__IO_REG8    (TIM4_ARR,    0x52E8, __READ_WRITE);

/*-------------------------------------------------------------------------
 *      TIM4 bit fields
 *-----------------------------------------------------------------------*/
#ifdef __IAR_SYSTEMS_ICC__

#define TIM4_CR1_CEN             TIM4_CR1_bit.CEN
#define TIM4_CR1_UDIS            TIM4_CR1_bit.UDIS
#define TIM4_CR1_URS             TIM4_CR1_bit.URS
#define TIM4_CR1_OPM             TIM4_CR1_bit.OPM
#define TIM4_CR1_ARPE            TIM4_CR1_bit.ARPE

#define TIM4_CR2_MMS             TIM4_CR2_bit.MMS

#define TIM4_SMCR_SMS            TIM4_SMCR_bit.SMS
#define TIM4_SMCR_TS             TIM4_SMCR_bit.TS
#define TIM4_SMCR_MSM            TIM4_SMCR_bit.MSM

#define TIM4_IER_UIE             TIM4_IER_bit.UIE
#define TIM4_IER_TIE             TIM4_IER_bit.TIE

#define TIM4_SR1_UIF             TIM4_SR1_bit.UIF
#define TIM4_SR1_TIF             TIM4_SR1_bit.TIF

#define TIM4_EGR_UG              TIM4_EGR_bit.UG
#define TIM4_EGR_TG              TIM4_EGR_bit.TG

#define TIM4_PSCR_PSC            TIM4_PSCR_bit.PSC

#endif

/*-------------------------------------------------------------------------
 *      TIM4 bit masks
 *-----------------------------------------------------------------------*/
#define MASK_TIM4_CR1_CEN        0x01
#define MASK_TIM4_CR1_UDIS       0x02
#define MASK_TIM4_CR1_URS        0x04
#define MASK_TIM4_CR1_OPM        0x08
#define MASK_TIM4_CR1_ARPE       0x80

#define MASK_TIM4_CR2_MMS        0x70

#define MASK_TIM4_SMCR_SMS       0x07
#define MASK_TIM4_SMCR_TS        0x70
#define MASK_TIM4_SMCR_MSM       0x80

#define MASK_TIM4_IER_UIE        0x01
#define MASK_TIM4_IER_TIE        0x40

#define MASK_TIM4_SR1_UIF        0x01
#define MASK_TIM4_SR1_TIF        0x40

#define MASK_TIM4_EGR_UG         0x01
#define MASK_TIM4_EGR_TG         0x40

#define MASK_TIM4_PSCR_PSC       0x0F


/*-------------------------------------------------------------------------
 *      IR register definitions
 *-----------------------------------------------------------------------*/
/* Infra-red control register */
#ifdef __IAR_SYSTEMS_ICC__
typedef struct
{
  unsigned char IR_EN       : 1;
  unsigned char HS_EN       : 1;
} __BITS_IR_CR;
#endif
__IO_REG8_BIT(IR_CR,       0x52FF, __READ_WRITE, __BITS_IR_CR);


/*-------------------------------------------------------------------------
 *      IR bit fields
 *-----------------------------------------------------------------------*/
#ifdef __IAR_SYSTEMS_ICC__

#define IR_CR_IR_EN              IR_CR_bit.IR_EN
#define IR_CR_HS_EN              IR_CR_bit.HS_EN

#endif

/*-------------------------------------------------------------------------
 *      IR bit masks
 *-----------------------------------------------------------------------*/
#define MASK_IR_CR_IR_EN         0x01
#define MASK_IR_CR_HS_EN         0x02


/*-------------------------------------------------------------------------
 *      CMP register definitions
 *-----------------------------------------------------------------------*/
/* Comparator control register */
#ifdef __IAR_SYSTEMS_ICC__
typedef struct
{
  unsigned char BIAS_EN     : 1;
  unsigned char COMP2_EN    : 1;
  unsigned char COMP1_EN    : 1;
  unsigned char COMPREF     : 1;
  unsigned char POL         : 1;
  unsigned char CNF_TIM0    : 1;
  unsigned char CNF_TIM1    : 1;
  unsigned char IC1_BK      : 1;
} __BITS_COMP_CR;
#endif
__IO_REG8_BIT(COMP_CR,     0x5300, __READ_WRITE, __BITS_COMP_CR);

/* Comparator status register */
#ifdef __IAR_SYSTEMS_ICC__
typedef struct
{
  unsigned char COMP1_OUT   : 1;
  unsigned char COMP2_OUT   : 1;
  unsigned char             : 2;
  unsigned char CEF1        : 1;
  unsigned char ITEN1       : 1;
  unsigned char CEF2        : 1;
  unsigned char ITEN2       : 1;
} __BITS_COMP_CSR;
#endif
__IO_REG8_BIT(COMP_CSR,    0x5301, __READ_WRITE, __BITS_COMP_CSR);

/* Comparator channel selection register */
#ifdef __IAR_SYSTEMS_ICC__
typedef struct
{
  unsigned char COMP1_CH1   : 1;
  unsigned char COMP1_CH2   : 1;
  unsigned char COMP1_CH3   : 1;
  unsigned char COMP1_CH4   : 1;
  unsigned char COMP2_CH1   : 1;
  unsigned char COMP2_CH2   : 1;
  unsigned char COMP2_CH3   : 1;
  unsigned char COMP2_CH4   : 1;
} __BITS_COMP_CCS;
#endif
__IO_REG8_BIT(COMP_CCS,    0x5302, __READ_WRITE, __BITS_COMP_CCS);


/*-------------------------------------------------------------------------
 *      CMP bit fields
 *-----------------------------------------------------------------------*/
#ifdef __IAR_SYSTEMS_ICC__

#define COMP_CR_BIAS_EN          COMP_CR_bit.BIAS_EN
#define COMP_CR_COMP2_EN         COMP_CR_bit.COMP2_EN
#define COMP_CR_COMP1_EN         COMP_CR_bit.COMP1_EN
#define COMP_CR_COMPREF          COMP_CR_bit.COMPREF
#define COMP_CR_POL              COMP_CR_bit.POL
#define COMP_CR_CNF_TIM0         COMP_CR_bit.CNF_TIM0
#define COMP_CR_CNF_TIM1         COMP_CR_bit.CNF_TIM1
#define COMP_CR_IC1_BK           COMP_CR_bit.IC1_BK

#define COMP_CSR_COMP1_OUT       COMP_CSR_bit.COMP1_OUT
#define COMP_CSR_COMP2_OUT       COMP_CSR_bit.COMP2_OUT
#define COMP_CSR_CEF1            COMP_CSR_bit.CEF1
#define COMP_CSR_ITEN1           COMP_CSR_bit.ITEN1
#define COMP_CSR_CEF2            COMP_CSR_bit.CEF2
#define COMP_CSR_ITEN2           COMP_CSR_bit.ITEN2

#define COMP_CCS_COMP1_CH1       COMP_CCS_bit.COMP1_CH1
#define COMP_CCS_COMP1_CH2       COMP_CCS_bit.COMP1_CH2
#define COMP_CCS_COMP1_CH3       COMP_CCS_bit.COMP1_CH3
#define COMP_CCS_COMP1_CH4       COMP_CCS_bit.COMP1_CH4
#define COMP_CCS_COMP2_CH1       COMP_CCS_bit.COMP2_CH1
#define COMP_CCS_COMP2_CH2       COMP_CCS_bit.COMP2_CH2
#define COMP_CCS_COMP2_CH3       COMP_CCS_bit.COMP2_CH3
#define COMP_CCS_COMP2_CH4       COMP_CCS_bit.COMP2_CH4

#endif

/*-------------------------------------------------------------------------
 *      CMP bit masks
 *-----------------------------------------------------------------------*/
#define MASK_COMP_CR_BIAS_EN     0x01
#define MASK_COMP_CR_COMP2_EN    0x02
#define MASK_COMP_CR_COMP1_EN    0x04
#define MASK_COMP_CR_COMPREF     0x08
#define MASK_COMP_CR_POL         0x10
#define MASK_COMP_CR_CNF_TIM0    0x20
#define MASK_COMP_CR_CNF_TIM1    0x40
#define MASK_COMP_CR_IC1_BK      0x80

#define MASK_COMP_CSR_COMP1_OUT  0x01
#define MASK_COMP_CSR_COMP2_OUT  0x02
#define MASK_COMP_CSR_CEF1       0x10
#define MASK_COMP_CSR_ITEN1      0x20
#define MASK_COMP_CSR_CEF2       0x40
#define MASK_COMP_CSR_ITEN2      0x80

#define MASK_COMP_CCS_COMP1_CH1  0x01
#define MASK_COMP_CCS_COMP1_CH2  0x02
#define MASK_COMP_CCS_COMP1_CH3  0x04
#define MASK_COMP_CCS_COMP1_CH4  0x08
#define MASK_COMP_CCS_COMP2_CH1  0x10
#define MASK_COMP_CCS_COMP2_CH2  0x20
#define MASK_COMP_CCS_COMP2_CH3  0x40
#define MASK_COMP_CCS_COMP2_CH4  0x80


/*-------------------------------------------------------------------------
 *      CPU register definitions
 *-----------------------------------------------------------------------*/
/* Accumulator */
__IO_REG8    (CPU_A,       0x7F00, __READ_WRITE);
/* Program counter extended */
__IO_REG8    (CPU_PCE,     0x7F01, __READ_WRITE);
/* Program counter high */
__IO_REG8    (CPU_PCH,     0x7F02, __READ_WRITE);
/* Program counter low */
__IO_REG8    (CPU_PCL,     0x7F03, __READ_WRITE);
/* X index register high */
__IO_REG8    (CPU_XH,      0x7F04, __READ_WRITE);
/* X index register low */
__IO_REG8    (CPU_XL,      0x7F05, __READ_WRITE);
/* Y index register high */
__IO_REG8    (CPU_YH,      0x7F06, __READ_WRITE);
/* Y index register low */
__IO_REG8    (CPU_YL,      0x7F07, __READ_WRITE);
/* Stack pointer high */
__IO_REG8    (CPU_SPH,     0x7F08, __READ_WRITE);
/* Stack pointer low */
__IO_REG8    (CPU_SPL,     0x7F09, __READ_WRITE);
/* Condition code register */
#ifdef __IAR_SYSTEMS_ICC__
typedef struct
{
  unsigned char C           : 1;
  unsigned char Z           : 1;
  unsigned char N           : 1;
  unsigned char I0          : 1;
  unsigned char H           : 1;
  unsigned char I1          : 1;
  unsigned char             : 1;
  unsigned char V           : 1;
} __BITS_CPU_CCR;
#endif
__IO_REG8_BIT(CPU_CCR,     0x7F0A, __READ_WRITE, __BITS_CPU_CCR);

